In [2]:
import numpy as np
import pandas as pd

df = pd.read_csv('salaries.csv')
df.head()

  Company                  Job     Degree  Salary_more_than_100K
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [3]:
df.shape

(16, 4)

In [4]:
df.describe()

       Salary_more_than_100K
count                 16.000
mean                   0.625
std                    0.500
min                    0.000
25%                    0.000
50%                    1.000
75%                    1.000
max                    1.000

In [8]:
X = df.drop('Salary_more_than_100K', axis='columns')
X

       Company                  Job     Degree
0       google      sales executive  bachelors
1       google      sales executive    masters
2       google     business manager  bachelors
3       google     business manager    masters
4       google  computer programmer  bachelors
5       google  computer programmer    masters
6   abc pharma      sales executive  bachelors
7   abc pharma  computer programmer    masters
8   abc pharma     business manager  bachelors
9   abc pharma     business manager    masters
10    facebook      sales executive  bachelors
11    facebook      sales executive    masters
12    facebook     business manager  bachelors
13    facebook     business manager    masters
14    facebook  computer programmer  bachelors
15    facebook  computer programmer    masters

In [6]:
y = df['Salary_more_than_100K']
y

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: Salary_more_than_100K, dtype: int64

In [10]:
from sklearn.preprocessing import LabelEncoder
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [12]:
X['Company_n'] = le_company.fit_transform(X['Company'])
X['Job_n'] = le_job.fit_transform(X['Job'])
X['Degree_n'] = le_degree.fit_transform(X['Degree'])
X

       Company                  Job     Degree  Company_n  Job_n  Degree_n
0       google      sales executive  bachelors          2      2         0
1       google      sales executive    masters          2      2         1
2       google     business manager  bachelors          2      0         0
3       google     business manager    masters          2      0         1
4       google  computer programmer  bachelors          2      1         0
5       google  computer programmer    masters          2      1         1
6   abc pharma      sales executive  bachelors          0      2         0
7   abc pharma  computer programmer    masters          0      1         1
8   abc pharma     business manager  bachelors          0      0         0
9   abc pharma     business manager    masters          0      0         1
10    facebook      sales executive  bachelors          1      2         0
11    facebook      sales executive    masters          1      2         1
12    facebook     business manager  bachelors          1      0         0
13    facebook     business manager    masters          1      0         1
14    facebook  computer programmer  bachelors          1      1         0
15    facebook  computer programmer    masters          1      1         1

In [13]:
X_n = X.drop(['Company', 'Job', 'Degree'], axis='columns')
X_n

    Company_n  Job_n  Degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         0
7           0      1         1
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [14]:
y

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: Salary_more_than_100K, dtype: int64

In [15]:
from sklearn import tree

model = tree.DecisionTreeClassifier()
model.fit(X_n, y)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [16]:
model.score(X_n, y)

1.0

In [17]:
model.predict([[2,1,0]])

array([0], dtype=int64)

In [18]:
model.predict([[2,1,1]])

array([1], dtype=int64)

In [21]:
from sklearn.externals import joblib
joblib.dump(model,'model_SalaryPrediction')

['model_SalaryPrediction']

In [24]:
tree.export_graphviz(model)

'digraph Tree {\nnode [shape=box] ;\n0 [label="X[0] <= 0.5\\ngini = 0.469\\nsamples = 16\\nvalue = [6, 10]"] ;\n1 [label="X[1] <= 0.5\\ngini = 0.375\\nsamples = 4\\nvalue = [3, 1]"] ;\n0 -> 1 [labeldistance=2.5, labelangle=45, headlabel="True"] ;\n2 [label="X[2] <= 0.5\\ngini = 0.5\\nsamples = 2\\nvalue = [1, 1]"] ;\n1 -> 2 ;\n3 [label="gini = 0.0\\nsamples = 1\\nvalue = [1, 0]"] ;\n2 -> 3 ;\n4 [label="gini = 0.0\\nsamples = 1\\nvalue = [0, 1]"] ;\n2 -> 4 ;\n5 [label="gini = 0.0\\nsamples = 2\\nvalue = [2, 0]"] ;\n1 -> 5 ;\n6 [label="X[0] <= 1.5\\ngini = 0.375\\nsamples = 12\\nvalue = [3, 9]"] ;\n0 -> 6 [labeldistance=2.5, labelangle=-45, headlabel="False"] ;\n7 [label="gini = 0.0\\nsamples = 6\\nvalue = [0, 6]"] ;\n6 -> 7 ;\n8 [label="X[1] <= 0.5\\ngini = 0.5\\nsamples = 6\\nvalue = [3, 3]"] ;\n6 -> 8 ;\n9 [label="gini = 0.0\\nsamples = 2\\nvalue = [0, 2]"] ;\n8 -> 9 ;\n10 [label="X[1] <= 1.5\\ngini = 0.375\\nsamples = 4\\nvalue = [3, 1]"] ;\n8 -> 10 ;\n11 [label="X[2] <= 0.5\\ngini = 0.5\\nsamples = 2\\nvalue = [1, 1]"] ;\n10 -> 11 ;\n12 [label="gini = 0.0\\nsamples = 1\\nvalue = [1, 0]"] ;\n11 -> 12 ;\n13 [label="gini = 0.0\\nsamples = 1\\nvalue = [0, 1]"] ;\n11 -> 13 ;\n14 [label="gini = 0.0\\nsamples = 2\\nvalue = [2, 0]"] ;\n10 -> 14 ;\n}'

In [29]:
tree.export_graphviz(model,
                    out_file='Salary-Prediction.dot')